export const fakeData = [
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
  {
    id: '6b121549-5fcc-4ada-8301-d51a89db4fa10002',
    userName: 'بهيجة أشرق لبن',
    createdBy: 'waelkamira@gmail.com',
    userImage:
      'https://res.cloudinary.com/dh2xlutfu/image/upload/v1718716951/cooking/bahiga_cmzcf4.png',
    mealName: 'بف بستري محشوة بالكرز والجبن الكريمي',
    selectedValue: 'وجبة رئيسية',
    image:
      'https://kitchen.sayidaty.net/uploads/small/6d/6d0335b0da5a1709ef950cf92fc82a21_w750_h500.jpg',
    ingredients:
      '- كرز أحمر :\n' +
      'كوب وثلاثة ارباع الكوب\n' +
      '(مقطع أنصاف ومزال البذور)\n' +
      '\n' +
      '\n' +
      '- سكر :\n' +
      '5 ملاعق كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- طحين :\n' +
      '4 ملعقة صغيرة\n' +
      '(كمية إضافية)\n' +
      '\n' +
      '\n' +
      '- ملح :\n' +
      'ربع ملعقة صغيرة \n' +
      '\n' +
      '- برش ليمون :\n' +
      'نصف ملعقة صغيرة \n' +
      '\n' +
      '- عصير الليمون :\n' +
      'ملعقة كبيرة \n' +
      '\n' +
      '- الجبن الكريمي ',
    theWay:
      '1. سخني الفرن على حرارة 400 درجة.\n' +
      '2. اخلطي كوب وربع من الكرز مع ربع كوب من السكر و 4 ملاعق صغيرة من الطحين والملح في قدر على نار متوسطة حتى يبدأ المزيج بالغليان مع التحريك لمدة دقيقة.\n' +
      '3. ارفعي القدر عن النار واتركي المزيج حتى يبرد لمدة نصف ساعة.\n' +
      '4. بعد النصف ساعة أضيفي نصف كوب من الكرز وعصير الليمون وحركي قليلا ثم اتركي القدر جانبا.\n' +
      '5. اخفقي الجبن الكريمي وعصير الليمون وصفار البيض وملعقتين من السكر على سرعة متوسطة حتى يصبح المزيج ناعما.\n' +
      '6. أضيفي جوز الهند للخليط وقلبي ثم أضيفي الملعقة الكبيرة من الطحين.\n' +
      '7. رشي على سطح الطاولة رشة طحين ومدي عجينة البف بستري قليلا ثم ضعي العجين في صينية، أدخليه للثلاجة لمدة 15 دقيقة.\n' +
      '8. أخرجي العجين من الثلاجة ووزعي كمية حوالي ملعقة من خليط الجبن وملعقتين من خليط الكرز وأغلقي العجين على شكل مثلث مع الحرص على إغلاق الأطراف جيدا بواسطة الشوكة.\n' +
      '9. اخفقي البيضة وادهني وجه العجين بواسطة فرشاة ثم ضعي العجين بالفريزر لمدة 15 دقيقة.\n' +
      '10. أخرجي العجينة من الفريزر وضعي البف بستري المحشو في صينية الفرن وأدخليه الفرن لمدة 30 – 35 دقيقة حتى تصبح ذهبية ومقرمشة.\n' +
      '11. قدميها ساخنة أو دافئة.',
    advise: '',
    link: '',
    createdAt: '2024-07-13 18:02:53.313+00',
    updatedAt: '2024-07-13 18:02:53.313+00',
    hearts: '0',
    likes: '0',
    emojis: '0',
  },
];
